app/controllers/pizzas_controller.rb

SELECT "pizzas".* FROM "pizzas"
---
    def index
        pizzas = Pizza.all

INSERT INTO "pizzas" ("name", "ingredients", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hswjsj"], ["ingredients", "Tomato, Basil"], ["created_at", "2023-03-22 07:58:09.091299"], ["updated_at", "2023-03-22 07:58:09.091299"]]
---
    def create
        pizza = Pizza.create(pizza_params)