app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Matanu"], ["address", "Ukunda"], ["created_at", "2023-03-22 07:10:44.928862"], ["updated_at", "2023-03-22 07:10:44.928862"]]
---
    def create
        restaurant = Restaurant.create(restaurant_params)

DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 3]]
---
    def destroy
        restaurant = find_restaurant
        if restaurant
            restaurant.destroy

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_restaurant
        Restaurant.find_by(id: params[:id])