app/controllers/restaurant_pizzas_controller.rb

SELECT "restaurant_pizzas".* FROM "restaurant_pizzas"
---
    def index
        restaurant_pizzas = RestaurantPizza.all

INSERT INTO "restaurant_pizzas" ("price", "restaurant_id", "pizza_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 22], ["restaurant_id", 5], ["pizza_id", 1], ["created_at", "2023-03-22 07:51:46.958505"], ["updated_at", "2023-03-22 07:51:46.958505"]]
---
    def create
        restaurant_pizza = RestaurantPizza.create(restaurant_pizza_params)

DELETE FROM "restaurant_pizzas" WHERE "restaurant_pizzas"."id" = ?  [["id", 3]]
---
    def destroy
        restaurant_pizza = find_restaurant_pizza
        if restaurant_pizza
            restaurant_pizza.destroy

SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "restaurant_pizzas".* FROM "restaurant_pizzas" WHERE "restaurant_pizzas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def find_restaurant_pizza
        RestaurantPizza.find_by(id: params[:id])